# items_data.py
BARTER_ITEMS = [
    {
        "name": "АКС-74У",
        "tier": 1,
        "category": "shotguns",
        "level": "Ставка Атамана | 1 ур.",
        "rarity": "white",
        "image": "aks74u.png",
        "parent": None,
        "price": 980,
        "resources": {
            "Болотный камень": 0,
            "Зеленая плесень": 0,
            "Срачник": 0
        }
    },
    {
        "name": "АКС-74",
        "tier": 2,
        "category": "shotguns",
        "level": "Ставка Атамана | 4 Ур.",
        "rarity": "green",
        "image": "aks74.png",
        "parent": "АКС-74У",
        "price": 2640,
        "resources": {
            "Болотный камень": 42,
            "Зеленая плесень": 33,
            "АКС-74У": 1
        }
    },
    {
        "name": "АКС-74М",
        "tier": 3,
        "category": "shotguns",
        "level": "Пожарная часть | 2 ур.",
        "rarity": "green",
        "image": "aks74m.png",
        "parent": "АКС-74",
        "price": 6280,
        "resources": {
            "Остатки медной проволки": 40,
            "Корень-вонючка": 41,
            "Срачник": 38,
            "АКС-74": 1,

        }
    },
    {
        "name": "АН-94 <Абакан>",
        "tier": 4,
        "category": "shotguns",
        "level": "Бар | 3 Ур.",
        "rarity": "blue",
        "image": "ah94.png",
        "parent": "АКС-74М",
        "price": 58300,
        "resources": {
            "Рассольник": 166,
            "Росток чернобыльской ромашки": 220,
            "Остатки радиопередатчика": 140,
            "Фрагмент данных <Альфа>": 34,
            "АКС-74М": 1,
        }
    },
    {
        "name": "АН-94М <Абакан>",
        "tier": 5,
        "category": "shotguns",
        "level": "Бар | 7 Ур.",
        "rarity": "purple",
        "image": "ah94m.png",

        "price": 295000,
        "resources": {
            "Остатки аккумуляторов": 450,
            "Северный мох": 867,
            "Дурман-камень": 140,
            "Фрагмент данных <Бета>": 125,
            "АН-94 <Абакан>": 1,
        }
    },
    {
        "name": "АЕК-971",
        "tier": 6,
        "category": "shotguns",
        "level": "База фракций севера | 4 Ур.",
        "rarity": "purple",
        "image": "aek.png",
        "parent": "АН-94М <Абакан>",
        "price": 1070000,
        "resources": {
            "Аномальная сыворотка": 10,
            "Вещество 07270": 2373,
            "Квантовая батарея": 486,
            "Фрагмент данных <Гамма>": 492,
            "Рыжий папоротник": 586,
            "Остатки пси-маячка": 737,
            "АН-94М <Абакан>": 1,
        }
    },
    {
        "name": "А-545",
        "tier": 7,
        "category": "shotguns",
        "level": "База фракций севера | 6 Ур.",
        "rarity": "red",
        "image": "a545.png",
        "parent": "АЕК-971",
        "price": 2220000,
        "resources": {
            "Аномальная сыворотка": 55,
            "Вещество 07270": 4939,
            "Квантовая батарея": 1011,
            "Фрагмент данных <Гамма>": 1023,
            "Рыжий папоротник": 1220,
            "Остатки пси-маячка": 1534,
            "АЕК-971": 1,
        }
    },
###фв
    {
        "name": "АКМ",
        "tier": 4,
        "category": "shotguns",
        "level": "Бар | 3 ур.",
        "rarity": "blue",
        "image": "АКМ.png",
        "parent": "АК-74М",
        "price": 58300,
        "resources": {
            "Росток чернобыльской ромашки": 220,
            "Остатки радиопередатчика": 140,
            "Рассольник": 166,
            "Фрагмент данных <Альфа>": 34,
            "АК-74М": 1,
        }
    },
    {
        "name": "АКМ <Тишина>",
        "tier": 5,
        "category": "shotguns",
        "level": "Бар | 7 Ур.",
        "rarity": "purple",
        "image": "АКМТИШИНА.png",

        "price": 295000,
        "resources": {
            "Остатки аккумуляторов": 450,
            "Северный мох": 867,
            "Дурман-камень": 899,
            "Фрагмент данных <Бета>": 125,
            "АКМ": 1,
        }
    },
    {
        "name": "АС <Вал>",
        "tier": 6,
        "category": "shotguns",
        "level": "База фракций севера | 4 Ур.",
        "rarity": "purple",
        "image": "АСВАЛ.png",
        "parent": "АКМ <Тишина>",
        "price": 1070000,
        "resources": {
            "Аномальная сыворотка": 10,
            "Вещество 07270": 2373,
            "Квантовая батарея": 486,
            "Фрагмент данных <Гамма>": 492,
            "Рыжий папоротник": 586,
            "Остатки пси-маячка": 737,
            "АКМ <Тишина>": 1,
        }
    },
    {
        "name": "ВСС <Винторез>",
        "tier": 6,
        "category": "shotguns",
        "level": "База фракций севера | 4 Ур.",
        "rarity": "purple",
        "image": "ВСС.png",
        "parent": "АКМ <Тишина>",
        "price": 1070000,
        "resources": {
            "Аномальная сыворотка": 10,
            "Вещество 07270": 2288,
            "Квантовая батарея": 469,
            "Фрагмент данных <Гамма>": 480,
            "Рыжий папоротник": 564,
            "Остатки пси-маячка": 709,
            "АКМ <Тишина>": 1,
        }
    },
    {
        "name": "АМБ-17",
        "tier": 7,
        "category": "shotguns",
        "level": "База фракций севера | 6 Ур.",
        "rarity": "red",
        "image": "AMБ-17.png",
        "parent": "АС <Вал>",
        "price": 2220000,
        "resources": {
            "Аномальная сыворотка": 55,
            "Вещество 07270": 4939,
            "Квантовая батарея": 1011,
            "Фрагмент данных <Гамма>": 1023,
            "Рыжий папоротник": 1220,
            "Остатки пси-маячка": 1534,
            "АС <Вал>": 1,
        }
    },
    {
        "name": "M16A1",
        "tier": 1,
        "category": "shotguns",
        "level": "Ставка Атамана | 1 ур.",
        "rarity": "white",
        "image": "М16А1.png",
        "parent": None,
        "price": 940,
        "resources": {
            "Болотный камень": 0,
            "Зеленая плесень": 0,
            "Срачник": 0
        }
    },
    {
        "name": "М16А2",
        "tier": 2,
        "category": "shotguns",
        "level": "Ставка Атамана | 4 Ур.",
        "rarity": "green",
        "image": "M16A2.png",
        "parent": "М16А1",
        "price": 2640,
        "resources": {
            "Болотный камень": 42,
            "Зеленая плесень": 33,
            "М16А1": 1
        }
    },
    {
        "name": "М16А3",
        "tier": 3,
        "category": "shotguns",
        "level": "Пожарная часть | 2 ур.",
        "rarity": "green",
        "image": "M16A3.png",
        "parent": "М16А2",
        "price": 6280,
        "resources": {
            "Остатки медной проволки": 40,
            "Корень-вонючка": 41,
            "Срачник": 38,
            "М16А2": 1,

        }
    },
    {
        "name": "M4A1",
        "tier": 4,
        "category": "shotguns",
        "level": "Бар | 3 Ур.",
        "rarity": "blue",
        "image": "M4A1.png",
        "parent": "М16А3",
        "price": 58300,
        "resources": {
            "Рассольник": 166,
            "Росток чернобыльской ромашки": 220,
            "Остатки радиопередатчика": 113,
            "Фрагмент данных <Альфа>": 42,
            "М16А3": 1,
        }
    },
    {
        "name": "LWRC M6",
        "tier": 5,
        "category": "shotguns",
        "level": "Бар | 7 Ур.",
        "rarity": "purple",
        "image": "LWRC_M6.png",
        "parent": "M4A1",

        "price": 295000,
        "resources": {
            "Остатки аккумуляторов": 364,
            "Северный мох": 867,
            "Дурман-камень": 140,
            "Фрагмент данных <Бета>": 155,
            "M4A1": 1,
        }
    },
    {
        "name": "SIG 516",
        "tier": 6,
        "category": "shotguns",
        "level": "База фракций севера | 4 Ур.",
        "rarity": "purple",
        "image": "SIG_516.png",
        "parent": "LWRC M6",
        "price": 1070000,
        "resources": {
            "Аномальная сыворотка": 10,
            "Вещество 07270": 2373,
            "Квантовая батарея": 486,
            "Фрагмент данных <Гамма>": 492,
            "Рыжий папоротник": 586,
            "Остатки пси-маячка": 737,
            "LWRC M6": 1,
        }
    },
    {
        "name": "KS-1",
        "tier": 7,
        "category": "shotguns",
        "level": "База фракций севера | 6 Ур.",
        "rarity": "red",
        "image": "KS-1.png",
        "parent": "SIG 516",
        "price": 2220000,
        "resources": {
            "Аномальная сыворотка": 55,
            "Вещество 07270": 4939,
            "Квантовая батарея": 1011,
            "Фрагмент данных <Гамма>": 1023,
            "Рыжий папоротник": 1220,
            "Остатки пси-маячка": 1534,
            "SIG 516": 1,
        }
    },
    {
        "name": "АК-103",
        "tier": 5,
        "category": "shotguns",
        "level": "Бар | 7 Ур.",
        "rarity": "purple",
        "image": "АК-103.png",
        "parent": "АКМ",

        "price": 295000,
        "resources": {
            "Остатки аккумуляторов": 450,
            "Северный мох": 867,
            "Дурман-камень": 899,
            "Фрагмент данных <Бета>": 125,
            "АКМ": 1,
        }
    },
    {
        "name": "АК-203",
        "tier": 6,
        "category": "shotguns",
        "level": "База фракций севера | 4 Ур.",
        "rarity": "purple",
        "image": "АК-203.png",
        "parent": "АК-103",
        "price": 1070000,
        "resources": {
            "Аномальная сыворотка": 10,
            "Вещество 07270": 2373,
            "Квантовая батарея": 486,
            "Фрагмент данных <Гамма>": 492,
            "Рыжий папоротник": 586,
            "Остатки пси-маячка": 737,
            "АК-103": 1,
        }
    },
    {
        "name": "АК-15",
        "tier": 7,
        "category": "shotguns",
        "level": "База фракций севера | 6 Ур.",
        "rarity": "red",
        "image": "AК-15.png",
        "parent": "АК-203",
        "price": 2220000,
        "resources": {
            "Аномальная сыворотка": 55,
            "Вещество 07270": 4939,
            "Квантовая батарея": 1011,
            "Фрагмент данных <Гамма>": 1215,
            "Рыжий папоротник": 1220,
            "Остатки пси-маячка": 1292,
            "АК-203": 1,
        }
    },
{
        "name": "АК-103",
        "tier": 5,
        "category": "shotguns",
        "level": "Бар | 7 Ур.",
        "rarity": "purple",
        "image": "АК-103.png",

        "price": 295000,
        "resources": {
            "Остатки аккумуляторов": 450,
            "Северный мох": 867,
            "Дурман-камень": 899,
            "Фрагмент данных <Бета>": 125,
            "АКМ": 1,
        }
    },
    {
        "name": "ОЦ-14 <Гроза>",
        "tier": 6,
        "category": "shotguns",
        "level": "База фракций севера | 4 Ур.",
        "rarity": "purple",
        "image": "ОЦ14.png",
        "parent": "АК-203",
        "price": 962000,
        "resources": {
            "Аномальная сыворотка": 10,
            "Лимбоплазма": 14,
            "Лимб": 1015,
            "Аномальная батарея": 33,
            "Фрагмент данных <Лямбда>": 492,
            "Горьколистник": 982,
            "АК-103": 1,
        }
    },
    {
        "name": "АШ-12",
        "tier": 7,
        "category": "shotguns",
        "level": "База фракций севера | 6 Ур.",
        "rarity": "red",
        "image": "АШ-12.png",
        "parent": "ОЦ-14 <Гроза>",
        "price": 2010000,
        "resources": {
            "Аномальная сыворотка": 55,
            "Лимб": 2144,
            "Аномальная батарея": 68,
            "Фрагмент данных <Лямбда>": 382,
            "Горьколистник": 1220,
            "Лимбоплазма": 31,
            "ОЦ-14 <Гроза>": 1,
        }
    },

]